rails/app/controllers/posts_controller.rb

INSERT INTO `posts` (`updated_at`, `body`, `subject`, `user_id`, `created_at`) VALUES('2009-02-22 20:25:40', 'Here is a new post created through Flails!', 'test123', 1, '2009-02-22 20:25:40')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `body` = 'Here is a new post updated through Flails!', `subject` = 'This post was updated', `updated_at` = '2009-02-22 20:25:40' WHERE `id` = 1
---
  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM `posts` WHERE `id` = 88
---
  def destroy
    respond_to do |format|
      if @post.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 88)
---
    def find_post
      @post = Post.find(params[:id])